#ifndef WINDOW_MANAGER_H
#define WINDOW_MANAGER_H

#include "lvgl/lvgl.h"

//-----------------------------------------------------------------------------------------
// Перечисление всех окон в системе
typedef enum 
{
    WIN_ID_NONE = 0,

    WIN_ID_WATCHFACE,
	WIN_ID_CONTROL_CENTER,
    WIN_ID_MENU,
    WIN_ID_WIFI,
    WIN_ID_SETTINGS,

    WIN_ID_COUNT
	
} window_id_t;

//-----------------------------------------------------------------------------------------
// Типы анимаций перехода
typedef enum 
{
    WIN_ANIM_NONE = 0,

    WIN_ANIM_SLIDE_LEFT,
    WIN_ANIM_SLIDE_RIGHT,
    WIN_ANIM_SLIDE_UP,
    WIN_ANIM_SLIDE_DOWN,
    WIN_ANIM_FADE,         // Плавное проявление

	WIN_ANIM_COUNT

} window_anim_t;

//-----------------------------------------------------------------------------------------
// Конфигурация переходов по свайпам для каждого окна
typedef struct
{
    window_id_t left;
    window_id_t right;
    window_id_t up;
    window_id_t down;
} window_swipe_targets_t;

//-----------------------------------------------------------------------------------------
// Сигнатура функции инициализации окна (наполняет готовый пустой экран parent)
typedef void (*wnd_init_cb)(lv_obj_t *parent);

//-----------------------------------------------------------------------------------------
// Инициализирует менеджер окон и сбрасывает стек
void window_manager_init(void);

//-----------------------------------------------------------------------------------------
// Регистрирует функцию инициализации и маршруты свайпов для окна
void window_manager_register_wnd(window_id_t id, wnd_init_cb cb, window_swipe_targets_t swipes);

//-----------------------------------------------------------------------------------------
// Открывает окно по его ID с указанной анимацией
void window_open(window_id_t id, window_anim_t anim);

//-----------------------------------------------------------------------------------------
// Возвращает на предыдущее окно в стеке
bool window_back(window_anim_t anim);

//-----------------------------------------------------------------------------------------
// Очищает стек окон, оставляя только главное
void return_to_watchface(void);

//-----------------------------------------------------------------------------------------
// Возвращает ID текущего активного окна
window_id_t current_window_get_id(void);

//-----------------------------------------------------------------------------------------
#endif // WINDOW_MANAGER_H