#ifndef POWER_H
#define POWER_H

#include "esp_err.h"
#include <stdbool.h>

/* Пины питания для ревизии V2 */
#define VW_GPIO_POWER_HOLD    (GPIO_NUM_41)
#define VW_GPIO_BUTTON        (GPIO_NUM_40)
#define VW_GPIO_CHG_STAT      (GPIO_NUM_2)  // Пин статуса зарядки
#define VW_GPIO_BAT_ADC       (ADC_CHANNEL_0) // GPIO 1

//-----------------------------------------------------------------------------------------
// Инициализация всей системы питания:
// Перехват питания (Hold), АЦП для батареи и пин зарядки.
esp_err_t power_init(void);

//-----------------------------------------------------------------------------------------
//Получить уровень заряда в процентах (0-100)
uint8_t power_get_battery_percent(void);

//-----------------------------------------------------------------------------------------
//Получить уровень заряда в мили Вольтах mV 
uint32_t power_get_battery_mvolt(void);

//-----------------------------------------------------------------------------------------
// Проверить, идет ли сейчас зарядка (подключен ли USB)
// return true - заряжается, false - нет
bool power_get_battery_is_charging(void);

//-----------------------------------------------------------------------------------------
// Полное программное выключение устройства
void power_shutdown(void);

//-----------------------------------------------------------------------------------------

#endif // POWER_H
