#ifndef POWER_H
#define POWER_H

#include "esp_err.h"
#include <stdbool.h>

/* Пины питания для ревизии V2 */
#define VW_GPIO_POWER_HOLD    (GPIO_NUM_41)
#define VW_GPIO_BUTTON        (GPIO_NUM_40)
#define VW_GPIO_BAT_ADC       (ADC_CHANNEL_0)   // GPIO 1

//-----------------------------------------------------------------------------------------
// Инициализация всей системы питания:
// Перехват питания (Hold), АЦП для батареи.
esp_err_t power_init(void);

//-----------------------------------------------------------------------------------------
// Полное программное выключение устройства
void power_shutdown(void);

//-----------------------------------------------------------------------------------------

#endif // POWER_H
