#!/bin/bash

# Список папок для обработки
folders=("0-1" "1-2" "2-3" "3-4" "4-5" "5-6" "6-7" "7-8" "8-9" "9-0")

# Проходимся по каждой папке из списка
for folder in "${folders[@]}"; do
    echo "========================================"
    echo "Начинаю обработку папки: $folder"
    echo "========================================"
    
    # Запускаем ваш Python-скрипт для текущей папки
    python3 LVGLImage.py --ofmt C --cf RGB565 "$folder"
    
    # Проверяем, успешно ли выполнилась команда
    if [ $? -eq 0 ]; then
        echo "Папка $folder успешно сконвертирована."
    else
        echo "Ошибка при обработке папки $folder!"
    fi
    echo ""
done

echo "Все задачи завершены!"
