#ifndef GAME_H
#define GAME_H

#ifdef __cplusplus
extern "C" {
#endif

//-----------------------------------------------------------------------------------------
// Функция инициализации игры
void init();

//-----------------------------------------------------------------------------------------
// Функция перезапуска игры
void restart();

//-----------------------------------------------------------------------------------------
// Функция появления цели
void spawn_goal();

//-----------------------------------------------------------------------------------------
// Функция обновления состояния игры на 1 кадр
void update(float dt);

//-----------------------------------------------------------------------------------------
// Функция обработки нажатия игроком
void tap();

#ifdef __cplusplus
}
#endif // extern "C"

#endif // GAME_H
