#ifndef VW_WIFI_H
#define VW_WIFI_H

#include "esp_wifi.h"

//-----------------------------------------------------------------------------------------
/**
 * @brief Базовая инициализация сетевого стека и NVS. Вызывать один раз при старте!
 */
void wifi_init(void);

//-----------------------------------------------------------------------------------------
/**
 * @brief Сканирование сетей.
 * @param ap_count Максимальное количество сетей, которое вмещает ваш массив.
 * @param ap_info Указатель на массив структур wifi_ap_record_t.
 * @return Количество реально найденных и записанных в массив сетей.
 */
int wifi_get_ap_info(int ap_count, wifi_ap_record_t* ap_info);

//-----------------------------------------------------------------------------------------
/**
 * @brief Подключение к конкретной точке доступа.
 * @param ssid Имя сети (до 32 символов).
 * @param password Пароль (до 64 символов). Если сеть без пароля, передайте "".
 */
void wifi_connect_to_ap(const char* ssid, const char* password);

//-----------------------------------------------------------------------------------------
/**
 * @brief Синхронизация времени через интернет (SNTP).
 * Вызывать только ПОСЛЕ успешного подключения к Wi-Fi!
 */
void wifi_sntp_sync_time(void);

//-----------------------------------------------------------------------------------------
// Включение/выключение Wi-Fi модуля
void wifi_set_state(bool enable);

//-----------------------------------------------------------------------------------------

#endif // VW_WIFI_H